# **Getting Started with PANDAS....**

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {"name":["harry","rohan","ram"],
         "marks":[67,87,98],
         "city":["rampur","delhi","lmp"]
}

In [3]:
datF = pd.DataFrame(dict1)
datF

    name  marks    city
0  harry     67  rampur
1  rohan     87   delhi
2    ram     98     lmp

In [4]:
datF.to_csv("TestFriends.csv")

In [5]:
datF.to_csv("TestFriends_index.csv",index=False)

In [6]:
datF.head(2)

    name  marks    city
0  harry     67  rampur
1  rohan     87   delhi

In [7]:
datF.tail(2)

    name  marks   city
1  rohan     87  delhi
2    ram     98    lmp

In [8]:
datF.describe()

           marks
count   3.000000
mean   84.000000
std    15.716234
min    67.000000
25%    77.000000
50%    87.000000
75%    92.500000
max    98.000000

In [9]:
hridu = pd.read_csv("stocks.csv")
hridu

    Company Name  Price  Earnings Per Share   Book Value
0       Reliance   1467                  66          653
1     Tata Steel    391                  89          572
2        Infosys    650                  35          147
3      Axis Bank    739                  19          263
4  Bajaj Finance   4044                  69          341

In [10]:
hridu["Price"][1] = 400
hridu

C:\Users\hrida\AppData\Local\Temp\ipykernel_14888\3939612007.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hridu["Price"][1] = 400

    Company Name  Price  Earnings Per Share   Book Value
0       Reliance   1467                  66          653
1     Tata Steel    400                  89          572
2        Infosys    650                  35          147
3      Axis Bank    739                  19          263
4  Bajaj Finance   4044                  69          341

In [11]:
hridu.to_csv("hridu.csv", index=False)